v2206/atmospheric_AloisLuggerPlatz/precursor/0.orig/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 1e-5;

boundaryField
{
    #include            "include/ABLConditions"

    inlet
    {
        type            cyclic;
    }

    outlet
    {
        type            cyclic;
    }

    upperAtm
    {
        type            zeroGradient;
    }

    ground
    {
        type            epsilonWallFunction;
        value           uniform 0.075;
    }

    frontAtm
    {
        type            cyclic;
    }

    backAtm
    {
        type            cyclic;
    }
}


// ************************************************************************* //
