v2206/atmospheric_AloisLuggerPlatz/precursor/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

restore0Dir

runApplication blockMesh

runApplication decomposePar

# runApplication $(getApplication)

runParallel $(getApplication)

runApplication reconstructPar

rm -rf proc*

touch ABLpre.foam

#------------------------------------------------------------------------------
